ZkIsHere/QuorumESP/firmware/sdkconfig.defaults
# QuorumESP sdkconfig.defaults — template committed on purpose.
# The generated `sdkconfig` itself is git-ignored; copy/adjust per board.

# Target is classic ESP32 (has built-in Ethernet MAC). Set once:
#   idf.py set-target esp32
CONFIG_IDF_TARGET="esp32"

# OTA layout (see partitions.csv + docs/ota.md).
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"

# App rollback: a new image must confirm health or the bootloader
# reverts to the previous one (AGENTS.md §12).
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# WROOM-32D carries 4 MB flash (boot log confirms 4096k detected).
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y

# Round 2b mutual TLS needs the OPTIONAL-request knob (see network/tls.c:
# mbedTLS server authmode defaults to NONE, so without this the server never
# requests a client cert; enforcement is request + post-handshake CN check).
CONFIG_ESP_TLS_SERVER_MIN_AUTH_MODE_OPTIONAL=y

# SNTP talks to 2 servers (see network/time_sync.c).
CONFIG_LWIP_SNTP_MAX_SERVERS=2

# X.509 expiry enforcement (default OFF in IDF!). Without this, notBefore/
/// notAfter are IGNORED and expired certs verify clean. Requires wall-clock
/// (see network/time_sync.c); wrong time fails closed, which is correct.
CONFIG_MBEDTLS_HAVE_TIME_DATE=y

CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# Watchdog is mandatory for a quorum appliance (AGENTS.md §11).
CONFIG_ESP_TASK_WDT_EN=y
# Task watchdog must PANIC (reset), not just warn: a deadlocked quorum
# appliance must stop, never look alive. Proven live: hung task triggers
# reset (see docs/failure-matrix.md).
CONFIG_ESP_TASK_WDT_PANIC=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU0=y
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU1=y

# 4-session budget (measured in docs/bench.md): socket pool headroom +
# smaller TLS I/O buffers (handshake flights are ~2-4K; app records ≤2K).
CONFIG_LWIP_MAX_SOCKETS=16
CONFIG_MBEDTLS_SSL_IN_CONTENT_LEN=8192
CONFIG_MBEDTLS_SSL_OUT_CONTENT_LEN=4096
